**Data Transformation and Analysis:**
The original data should be transformed to make Data analysis. It means extracting meaningful insights(information). To do so follow the below methods
-i)   Sorting data
-ii)  Value count
-iii) Grouping Data
-iv)  Feature Engineering
-v)   Pivot Table
-vi)  Merging Dataframe
-vii) Exporting Dataframe

**Sorting Data:**
- To sort data in ascending or descending order we have a function.
- Sorting is useful to extract data easily.
- function:---->    df.sort_values(by = ['colum_name'],ascending = 'True')

In [3]:

import pandas as pd  #importing pandas library
import openpyxl      #importing openpyxl library to read/write Excel files

pd.read_excel(r"C:\Users\BASA VIKAS\Downloads\loan_data.xlsx") #reading the Excel file and creating a DataFrame

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001722,Male,Yes,0,Graduate,No,150,1800.0,135.0,360.0,1.0,Rural,N
1,LP002502,Female,Yes,2,Not Graduate,NaN,210,2917.0,98.0,360.0,1.0,Semiurban,Y
2,LP002949,Female,No,3+,Graduate,NaN,416,41667.0,350.0,180.0,NaN,Urban,N
3,LP002603,Female,No,0,Graduate,No,645,3683.0,113.0,480.0,1.0,Rural,Y
4,LP001644,NaN,Yes,0,Graduate,Yes,674,5296.0,168.0,360.0,1.0,Rural,Y
...,...,...,...,...,...,...,...,...,...,...,...,...,...
609,LP001640,Male,Yes,0,Graduate,Yes,39147,4750.0,120.0,360.0,1.0,Semiurban,Y
610,LP001536,Male,Yes,3+,Graduate,No,39999,0.0,600.0,180.0,0.0,Semiurban,Y
611,LP001585,NaN,Yes,3+,Graduate,No,51763,0.0,700.0,300.0,1.0,Urban,Y
612,LP002101,Male,Yes,0,Graduate,NaN,63337,0.0,490.0,180.0,1.0,Urban,Y
613,LP002317,Male,Yes,3+,Graduate,No,81000,0.0,360.0,360.0,0.0,Rural,N

In [4]:
df = pd.read_excel(r"C:\Users\BASA VIKAS\Downloads\loan_data.xlsx") #storing the DataFrame in a variable named df
df.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001722,Male,Yes,0,Graduate,No,150,1800.0,135.0,360.0,1.0,Rural,N
1,LP002502,Female,Yes,2,Not Graduate,NaN,210,2917.0,98.0,360.0,1.0,Semiurban,Y
2,LP002949,Female,No,3+,Graduate,NaN,416,41667.0,350.0,180.0,NaN,Urban,N
3,LP002603,Female,No,0,Graduate,No,645,3683.0,113.0,480.0,1.0,Rural,Y
4,LP001644,NaN,Yes,0,Graduate,Yes,674,5296.0,168.0,360.0,1.0,Rural,Y

In [ ]:
#Sorting Data
df.sort_values(by = ['ApplicantIncome'], ascending= True)

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001722,Male,Yes,0,Graduate,No,150,1800.0,135.0,360.0,1.0,Rural,N
1,LP002502,Female,Yes,2,Not Graduate,NaN,210,2917.0,98.0,360.0,1.0,Semiurban,Y
2,LP002949,Female,No,3+,Graduate,NaN,416,41667.0,350.0,180.0,NaN,Urban,N
3,LP002603,Female,No,0,Graduate,No,645,3683.0,113.0,480.0,1.0,Rural,Y
4,LP001644,NaN,Yes,0,Graduate,Yes,674,5296.0,168.0,360.0,1.0,Rural,Y
...,...,...,...,...,...,...,...,...,...,...,...,...,...
609,LP001640,Male,Yes,0,Graduate,Yes,39147,4750.0,120.0,360.0,1.0,Semiurban,Y
610,LP001536,Male,Yes,3+,Graduate,No,39999,0.0,600.0,180.0,0.0,Semiurban,Y
611,LP001585,NaN,Yes,3+,Graduate,No,51763,0.0,700.0,300.0,1.0,Urban,Y
612,LP002101,Male,Yes,0,Graduate,NaN,63337,0.0,490.0,180.0,1.0,Urban,Y
613,LP002317,Male,Yes,3+,Graduate,No,81000,0.0,360.0,360.0,0.0,Rural,N

In [ ]:
df.sort_values(by = ['ApplicantIncome'], ascending= False) #sorting in descending order

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
613,LP002317,Male,Yes,3+,Graduate,No,81000,0.0,360.0,360.0,0.0,Rural,N
612,LP002101,Male,Yes,0,Graduate,NaN,63337,0.0,490.0,180.0,1.0,Urban,Y
611,LP001585,NaN,Yes,3+,Graduate,No,51763,0.0,700.0,300.0,1.0,Urban,Y
610,LP001536,Male,Yes,3+,Graduate,No,39999,0.0,600.0,180.0,0.0,Semiurban,Y
609,LP001640,Male,Yes,0,Graduate,Yes,39147,4750.0,120.0,360.0,1.0,Semiurban,Y
...,...,...,...,...,...,...,...,...,...,...,...,...,...
4,LP001644,NaN,Yes,0,Graduate,Yes,674,5296.0,168.0,360.0,1.0,Rural,Y
3,LP002603,Female,No,0,Graduate,No,645,3683.0,113.0,480.0,1.0,Rural,Y
2,LP002949,Female,No,3+,Graduate,NaN,416,41667.0,350.0,180.0,NaN,Urban,N
1,LP002502,Female,Yes,2,Not Graduate,NaN,210,2917.0,98.0,360.0,1.0,Semiurban,Y
0,LP001722,Male,Yes,0,Graduate,No,150,1800.0,135.0,360.0,1.0,Rural,N

**Value counts:**
This method is used to count how many times the value is there in particular column
- function:---->  df['cloumn_name'].value_counts()

In [ ]:
#Value counts
df['Education'].value_counts()

Education
Graduate        480
Not Graduate    134
Name: count, dtype: int64

**Grouping Data:**
This method is used to group the data based on particular column
- It is called as "groupby"
- It is mainly used when we want to perform mathematical operations(Average..).
- function:---->  df.groupby('column_name')

In [14]:
#Grouping data
df.groupby('Gender').size()

Gender
Female    112
Male      489
dtype: int64

In [ ]:
df.groupby('Gender')['LoanAmount'].mean()  #calculating the mean loan amount for each gender

Gender
Female    126.697248
Male      149.265957
Name: LoanAmount, dtype: float64

**Feature Engineering:**
This method is used to create or Engineer a new data based on exsisting data.
- Example is creating new column based on exsisting data.

In [20]:
#Feature engineering
df['TotalIncome'] = df['ApplicantIncome'] + df['CoapplicantIncome']  #creating a new column 'TotalIncome' by adding 'ApplicantIncome' and 'CoapplicantIncome'
df.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status,TotalIncome
0,LP001722,Male,Yes,0,Graduate,No,150,1800.0,135.0,360.0,1.0,Rural,N,1950.0
1,LP002502,Female,Yes,2,Not Graduate,NaN,210,2917.0,98.0,360.0,1.0,Semiurban,Y,3127.0
2,LP002949,Female,No,3+,Graduate,NaN,416,41667.0,350.0,180.0,NaN,Urban,N,42083.0
3,LP002603,Female,No,0,Graduate,No,645,3683.0,113.0,480.0,1.0,Rural,Y,4328.0
4,LP001644,NaN,Yes,0,Graduate,Yes,674,5296.0,168.0,360.0,1.0,Rural,Y,5970.0

In [23]:
df['Valuable'] = 'No'
df.loc[(df['ApplicantIncome']> 4000) & (df['LoanAmount']> 200), 'Valuable'] = 'Yes'  #creating a new column 'Valuable' and assigning 'Yes' to rows where 'ApplicantIncome' is greater than 4000 and 'LoanAmount' is greater than 200, otherwise assigning 'No'
df.tail()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status,TotalIncome,Valuable
609,LP001640,Male,Yes,0,Graduate,Yes,39147,4750.0,120.0,360.0,1.0,Semiurban,Y,43897.0,No
610,LP001536,Male,Yes,3+,Graduate,No,39999,0.0,600.0,180.0,0.0,Semiurban,Y,39999.0,Yes
611,LP001585,NaN,Yes,3+,Graduate,No,51763,0.0,700.0,300.0,1.0,Urban,Y,51763.0,Yes
612,LP002101,Male,Yes,0,Graduate,NaN,63337,0.0,490.0,180.0,1.0,Urban,Y,63337.0,Yes
613,LP002317,Male,Yes,3+,Graduate,No,81000,0.0,360.0,360.0,0.0,Rural,N,81000.0,Yes

**Pivot Table:**
This method is used for transforming data to make Data Analysis.
- This concept has three important attributes such as: index , columns , values.
- In values it should be numerical.
- function:-----> df.pivot_table(index = ['column_name'],column = ['column_name'], values = ['column_name'])

In [26]:
#pivot tables
df.pivot_table(index = 'Gender', columns = 'Married', values = 'LoanAmount')  #creating a pivot table to count the number of occurrences of each education level for each combination

Married          No         Yes
Gender
Female   116.115385  153.322581
Male     136.088000  154.011662

In [27]:
df.pivot_table(index = 'Education', columns = 'Gender', values = 'TotalIncome')

Gender             Female         Male
Education
Graduate      5877.673913  7838.037021
Not Graduate  5171.000000  5031.070796

**Merging Dataframes:**
This is used to merge two dataframes into one
- To do merging there should be common cloumn in both dataframes.
- "innerjoin" is used to display common rows (intersection).
- "outerjoin" is used to display all (Union).
- function:------>  pd.merge(df1,df2 , on='common_column', how ='inner/outer')

In [30]:
#dataframe1
Students = pd.DataFrame({
       'student_id': [1, 2, 3, 4, 5],
       'name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
        'age': [20, 21, 19, 22, 20]
             })
Students.head()

   student_id     name  age
0           1    Alice   20
1           2      Bob   21
2           3  Charlie   19
3           4    David   22
4           5      Eve   20

In [41]:
#dataframe2
Courses = pd.DataFrame({
       'name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank'],
       'course_name': ['Mathematics', 'Physics', 'Chemistry', 'Biology', 'Computer Science', 'Art'],
       'credits': [3, 4, 3, 4, 3, 2]
             })
Courses

      name       course_name  credits
0    Alice       Mathematics        3
1      Bob           Physics        4
2  Charlie         Chemistry        3
3    David           Biology        4
4      Eve  Computer Science        3
5    Frank               Art        2

In [42]:
#merging dataframes
merged_df = pd.merge(Students, Courses, on = 'name')  #merging the Students and Courses DataFrames on the 'name' column
merged_df

   student_id     name  age       course_name  credits
0           1    Alice   20       Mathematics        3
1           2      Bob   21           Physics        4
2           3  Charlie   19         Chemistry        3
3           4    David   22           Biology        4
4           5      Eve   20  Computer Science        3

In [43]:
#merging dataframes based on inner join
merged_df = pd.merge(Students, Courses, on = 'name', how='inner')
merged_df

   student_id     name  age       course_name  credits
0           1    Alice   20       Mathematics        3
1           2      Bob   21           Physics        4
2           3  Charlie   19         Chemistry        3
3           4    David   22           Biology        4
4           5      Eve   20  Computer Science        3

In [44]:
#merging dataframes based on outer join
merged_df = pd.merge(Students, Courses, on = 'name', how='outer')
merged_df

   student_id     name   age       course_name  credits
0         1.0    Alice  20.0       Mathematics        3
1         2.0      Bob  21.0           Physics        4
2         3.0  Charlie  19.0         Chemistry        3
3         4.0    David  22.0           Biology        4
4         5.0      Eve  20.0  Computer Science        3
5         NaN    Frank   NaN               Art        2

**Expoting Dataset:**
This method is used to export dataset into excel or csv format.
- function:----> dataframe.to_csv("specify the path where the file should be saved")